import random
print('โปรแกรมเป่ายิ่งฉุบ')
while True:
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(a)
    print('เลือก ค้อน กรรไกร กระดาษ')
    i = str(input("คุณเลือก : "))
    if i == a :
        print("ผลลัพธ์คือ เสมอ")
        print('------------------------------')
    elif a == "กรรไกร" and i == "ค้อน" :
        print("คุณชนะ")
        print('------------------------------')
    elif a == "ค้อน" and i == "กระดาษ" :
        print("ผลลัพธ์คือ คุณชนะ")
        printI('-----------------------------')
    elif a == "กระดาษ" and i == "กรรไกร" :
        print("ผลลัพธ์คือ คุณชนะ")
        print('------------------------------')
    else :
        print("ผลลัพธ์ คือคุณแพ้")
        print('-------------------------------')